#include<stdio.h>
int main()
{
	int num;									// num = 값을 입력받을 변수
	scanf("%d", &num);							// num 값 입력받기
	for (int i = 0; i < num; i++)				// i = 0; i가 입력받은 값(num)보다 작을 때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
	{											
		for (int j = 0; j < i; j++)				// j = 0; j가 i보다 작을 때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
		{	
			printf(" ");						// j가 i보다 작을 때 " " 출력
		}
		for (int j = (num - i) * 2; j > 1; j--) // j는 (입력한 값(num) - i)*2; j가 1보다 클때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
		{
			printf("*");						// j가 1보다 크면 "*" 출력
		}
		printf("\n");							// " ", "*" 조건에 맞게 출력 후 줄 바꿈 실행

	}
	for (int i = 1; i < num; i++)				// i = 1; i가 입력받은 값(num)보다 작을 때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
	{
		for (int j = num - 1; j > i; j--)		// j = 입력받은 값(num) - 1; j가 i보다 클 때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
		{
			printf(" ");						// j가 i보다 클 때 " " 출력
		}
		for (int j = 0; j < 2 * i + 1; j++)		// j = 0; j가 2*i+1보다 작을 때까지만 반복(참일 때 실행문장이 실행된 후 증감식 실행)
		{
			printf("*");						// j가 2*i+1보다 작을 때 "*" 출력
		}
		printf("\n");							// " ", "*" 조건에 맞게 출력 후 줄 바꿈 실행
	}

	return 0;
}